# PartNotFoundInRoutingPreferenceWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..PartNotFoundInRoutingPreferenceWarning Property
BuiltInFailures..::..PipingFailures Class See Also
---
"%1s is not found. Please review the routing preference of %2s."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartNotFoundInRoutingPreferenceWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartNotFoundInRoutingPreferenceWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartNotFoundInRoutingPreferenceWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace